"""
Задача №41. Решение в группах
Дан массив, состоящий из целых чисел. Напишите
программу, которая в данном массиве определит
количество элементов, у которых два соседних и, при
этом, оба соседних элемента меньше данного. Сначала
вводится число N — количество элементов в массиве
Далее записаны N чисел — элементы массива. Массив
состоит из целых чисел.
Ввод:
5
1 2 3 4 5 
Вывод
0
Ввод:
5
1 5 1 5 1 
Вывод
2

"""

import random, os
os.system('cls')


N = [random.randint(0, 3) for _ in range(int(input()))]

print(*N)
count = 0
for i in range(1, len(N) - 1):
    if N[i - 1] < N[i] and N[i + 1] < N[i]:
        count += 1
print(count)

print(sum(list(1 for i in range(1, len(N) - 1) if N[i - 1] < N[i] and N[i + 1] < N[i])))
