# 3. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.***

# Пример:
# 1: мама мыла раму
# 2: ма
# Результат: 2

string1 = input()
string2 = input()
print(string1.count(string2))


